import * as Yup from "yup";

export const welcomeMessage = `Вітаємо у Mokko Coffee! 🧡
Ми створили цей бот, щоб ви могли легко керувати своїм профілем та першими дізнаватися про наші акції.

Що ви отримаєте:
✅ Доступ до спеціальних пропозицій.
✅ Зручний мобільний застосунок для замовлень.
✅ Персональні знижки для наших постійних гостей.

Пройдіть реєстрацію нижче для того, щоб почати користуватись застосунком!`;

export const validationSchema = Yup.object().shape({
  fullName: Yup.string()
    .min(2, "Ім’я та прізвище занадто короткі")
    .max(50, "Ім’я та прізвище занадто довгі")
    .matches(/^[a-zA-Zа-яА-ЯёЁіІїЇєЄґҐ\s]+$/, "Використовуйте лише літери")
    .required("Ім'я та прізвище обов'язкові"),

  phone: Yup.string()
    .matches(
      /^\+?[0-9]{10,12}$/,
      "Введіть коректний номер (наприклад, +380...)",
    )
    .required("Номер телефону обов’язковий"),
});
